use Hotels


Insert Into [Dictionary].[RoomType] ([Name], [Price], [Description])
Values
('Номер Эконом', 200, 'Номер для выживания. Кровать, санузел.'),
('Номер Стандарт', 500, 'Жилой номер. Кровать, санузел, холодильник, кондиционер.'),
('Номер Люкс', 1000, 'Комфотный жилой номер. Почувствуй себя человеком. Кровать, санузел, холодильник, кондиционер, ежедневная уборка.'),
('Массажный кабинет', Null, 'Тут Вас помнут.'),
('Спа', Null, 'Тут Вас расслабят.'),
('Ресторан', Null, 'Тут Вас накормят.')

Select *
From [Dictionary].[RoomType]

Insert Into [Dictionary].[StaffType] ([Name], [Salary])
Values
('Хостес',  50000),
('Горничная', 60000),
('Повар',  70000),
('Массажист', 60000),
('Банщик',  50000),
('Официант', 50000)

Select * 
From [Dictionary].[StaffType]

Insert Into [Dictionary].[ServiceType] ([Name], [Price], [Dyration], [RoomTypeId], [Description])
Values
('Заселение', 0, Null, Null , Null),
('Выселение', 0, Null, Null, Null),
('Уборка Эконом', 0, 1, 1 , Null),
('Уборка Стандарт' , 0, 1, 2, Null),
('Уборка Люкс', 0, 1, 3, Null),
('Массаж общий', 4000, 2, 4, 'Массаж всего тела'),
('Массаж в 4 руки', 5000, 1, 4, 'Массаж всего тела в 2 раза быстрей'),
('Массаж ног', 2000, 2, 4, 'Массаж ног'),
('Массаж лица', 3000, 1, 4, 'Скульптурный массаж лица'),
('Спа Хамам', 500, 1, 5, 'Турецкий хамам'),
('Спа Баня', 500, 1, 5, 'Финская баня'),
('Спа Джакузи', 500, 1, 5, 'Джакузи'),
('Спа Бассейн', 300, 1, 5, 'Бассейн'),
('Завтрак Эконом', 100, 1, 6, 'Манка с комочками'),
('Завтрак Стандарт', 250, 1, 6, 'Яичница с помидором'),
('Завтрак Люкс', 400, 1, 6, 'Блинчики с любовью'),
('Обед Эконом' , 200, 1, 6, 'Борщ с капустой, но не красный'),
('Обед Стандарт', 500, 1, 6, 'Пюре с котлетой по киевски'),
('Обед Люкс', 1000, 1, 6, 'Суп с лангустами'),
('Ужин Эконом' , 200, 1, 6, 'Сарделька с грустью'),
('Ужин Стандарт', 600, 1, 6, 'Карбонара'),
('Ужин Люкс', 1500, 1, 6, 'Стейк из мраморной говядины')

Select * 
From [Dictionary].[ServiceType]




Select * 
From [Dictionary].[ServiceType]

Select * 
From [Dictionary].[StaffType]

Insert Into [Dictionary].[ServiceStaff] (ServiceTypeId, StaffTypeId, Quantity)
Values
(1, 1, 1),
(2, 1, 1),
(3, 2, 2),
(4, 2, 2),
(5, 2, 1),
(6, 4, 1),
(7, 4, 2),
(8, 4, 1),
(9, 4, 1),
(10, 5, 1),
(11, 5, 1),
(12, 5, 1),
(13, 5, 1),
(14, 3, 1),
(14, 6, 1),
(15, 3, 1),
(15, 6, 1),
(16, 3, 1),
(16, 6, 1),
(17, 3, 1),
(17, 6, 1),
(18, 3, 1),
(18, 6, 1),
(19, 3, 1),
(19, 6, 1),
(20, 3, 1),
(20, 6, 1),
(21, 3, 1),
(21, 6, 1),
(22, 3, 1),
(22, 6, 1)

Select *
From [Dictionary].[ServiceStaff]

Select StaffType.[Name], ServiceType.[Name], Quantity
From [Dictionary].[ServiceStaff] 
Inner Join [Dictionary].ServiceType On ServiceStaff.ServiceTypeId = ServiceType.ServiceTypeId
Inner Join [Dictionary].StaffType On ServiceStaff.StaffTypeId = StaffType.StaffTypeId